src/cf/Catalogs/НастройкиПодключенияЗагрузкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияЗагрузкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерверЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьККартинкам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИскатьПоследнийКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапкеАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НастройкиПодключенияЗагрузкиНоменклатуры/Ext/ManagerModule.bsl
Функция ПолучитьФТПСоединение(Настройки, ЭтоКартинки = Ложь, ИмяКаталогаЗагрузки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АдресСайта = Настройки.СерверЗагрузки;
	
	
	Порт = 21;
	Логин = Настройки.ИмяПользователя;
	Пароль = Настройки.Пароль;
	
	FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль);
	
	Если ИмяКаталогаЗагрузки <> "" тогда
		ИмяКаталога = Настройки.ИмяКаталога + ИмяКаталогаЗагрузки + "/";		
	ИначеЕсли Настройки.ИскатьПоследнийКаталог = Истина тогда
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ИмяФайла");
		
		СписокКаталогов = FTPСоединение.НайтиФайлы(Настройки.ИмяКаталога,"*",Ложь);
		Если СписокКаталогов.Количество() > 0 тогда
			Для каждого ЭлементСписка из СписокКаталогов цикл
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.ИмяФайла = ЭлементСписка.Имя;				
			КонецЦикла;			
			ТЗ.Сортировать("ИмяФайла убыв");			
			ИмяКаталога = Настройки.ИмяКаталога + ТЗ[0].ИмяФайла + "/";			
		Иначе	
			ИмяКаталога = Настройки.ИмяКаталога;
		КонецЕсли;	
	Иначе	
		ИмяКаталога = Настройки.ИмяКаталога;
	КонецЕсли;		
	
	Если ЭтоКартинки тогда //VOG Ульянов И.В. DEV-101
		ИмяКаталога = ИмяКаталога + Настройки.ПутьККартинкам;
	КонецЕсли;		
	
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат FTPСоединение;
	
КонецФункции

Функция ПолучитьФайлЗагрузки(Настройки, ИмяКаталога="") Экспорт
	
	FTPСоединение = ПолучитьФТПСоединение(Настройки, ,ИмяКаталога);
	
	Если FTPСоединение.НайтиФайлы(Настройки.ФайлКаталога).Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	FTPСоединение.Получить(Настройки.ФайлКаталога,ИмяВременногоФайла );
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	
	УдалитьВременныйФайл(ИмяВременногоФайла);
	
	Возврат ЧтениеXML;
	
КонецФункции

Процедура УдалитьВременныйФайл(ПолноеИмяФайла)
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;            		
	Попытка
		УдалитьФайлы(ПолноеИмяФайла)
	Исключение
	КонецПопытки    	
КонецПроцедуры

Функция ПолучитьСписокКаталогов(Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АдресСайта = Настройки.СерверЗагрузки;	
	
	Порт = 21;
	Логин = Настройки.ИмяПользователя;
	Пароль = Настройки.Пароль;
	
	FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяФайла");
		
	СписокКаталогов = FTPСоединение.НайтиФайлы(Настройки.ИмяКаталога,"*",Ложь);
	Если СписокКаталогов.Количество() > 0 тогда
		Для каждого ЭлементСписка из СписокКаталогов цикл
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.ИмяФайла = ЭлементСписка.Имя;				
		КонецЦикла;			
	КонецЕсли;	
	                                     
	ТЗ.Сортировать("ИмяФайла Возр");
	
	Возврат ТЗ;
	
КонецФункции
